//PRTKSDS1  JOB (KC03HE9),'PRINT INVMASTI',CLASS=A,MSGCLASS=H
//STEP1     EXEC PGM=IDCAMS
//SYSPRINT  DD  SYSOUT=*
//INVMASTI  DD  DSN=KC03HE9.INVMASTI.KSDS,DISP=SHR
//SYSIN     DD  *
  PRINT INFILE(INVMASTI) CHAR
/*
